*** Accumulator

    #+NAME: accumulator
    #+HEADER: :goal main
    #+begin_src prolog :results value
    list([1,2,3,4,5]).

    accum([], A, A).
    accum([H|T], C, L) :- D is H+C, accum(T, D, L).


    main :- list(X), accum(X, 0, Y), print(Y), format(" True").
    main :- format("False").
    #+end_src

    #+RESULTS: accumulator
    : 15 True

*** Arithmetic

    #+NAME: Arithmetic
    #+HEADER: :goal main
    #+begin_src prolog :results value
    test(A) :- A = 2 + 3.


    main :- test(A), B is A, format("True: ~p", B).
    main :- format("False").
    #+end_src

    #+RESULTS: Arithmetic
    : True: 5

    #+NAME: arithmetic all
    #+HEADER: :goal main
    #+begin_src prolog :results value
    test(A) :- A = 2 + 3.
    test(A) :- A = 2 * 3.
    test(B) :- B = 10 / 2.

    eval([], []).
    eval([test(X)|T], Y) :- Z is X, eval(T, Q), Y = [Z|Q].

    main :- findall(test(A), test(A), B), eval(B,C), print(C), format(" True: ~p", C).
    main :- format("False").
    #+end_src

    #+RESULTS: arithmetic all
    | [5 | 6 | 5] True: 5 |


    #+NAME: arithmetic list
    #+HEADER: :goal main
    #+begin_src prolog :results value
      a :- 2 < 3, 2 =< 3, 3 > 2, 3 >= 1.
      b :- 2 =:= 2.
      %% operators force evaluation, unlike =
      c :- 3+1 =\= 3.

      main :- a, b, c, format("True").
      main :- format("False").
    #+end_src

    #+RESULTS: arithmetic list
    : True

*** Find all Solutions
    #+NAME: jealousy
    #+HEADER: :goal main
    #+begin_src prolog :results value
    loves(vincent, mia).
    loves(marcellus, mia).
    jealous(A,B) :- loves(A,C), loves(B,C), A \= B.

    main :-  findall(jealous(X,Y), jealous(X,Y), Z), print(Z).
    #+end_src

    #+RESULTS: jealousy
    | [jealous(vincent | marcellus) | jealous(marcellus | vincent)] |

